Pandas

In [2]:
import numpy as np
import pandas as pd

1. Working with Pandas Series

a) Creating Series
Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index. Labels need not be unique but must be a hashable type. The object supports both integer and label-based indexing and provides a host of methods for performing operations involving the index.

Seires through list

In [5]:
#pandas series through list
lst=[1,2,3,4,5,6]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [6]:
#Series through Numpy array
arr=np.array([1,2,3,4,5,6])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

Series Giving index on our own

In [7]:
pd.Series(index=["Naresh","Surya","Charvik","Venky","Yogii","Harii"],data=[1,2,3,4,5,6])

Naresh     1
Surya      2
Charvik    3
Venky      4
Yogii      5
Harii      6
dtype: int64

In [8]:
pd.Series(data=["Naresh","Surya","Charvik","Venky","Yogii","Harii"],index=[1,2,3,4,5,6])

1     Naresh
2      Surya
3    Charvik
4      Venky
5      Yogii
6      Harii
dtype: object

Series through Dictionary Values

In [9]:
steps={"Naresh":4285,"Akshith":4291,"Chakradhar":4291,"Yeswanth":4274}
pd.Series(steps)

Naresh        4285
Akshith       4291
Chakradhar    4291
Yeswanth      4274
dtype: int64

In [10]:
#Using repeat function along with creating a Series
#Pandas Series.repeat() function repeat elements of a Series. It returns a new Series where each element of the current Series is repeated consecutively a given number of times.
pd.Series(5).repeat(10)

0    5
0    5
0    5
0    5
0    5
0    5
0    5
0    5
0    5
0    5
dtype: int64

In [11]:
pd.Series(5).repeat(10).reset_index()

   index  0
0      0  5
1      0  5
2      0  5
3      0  5
4      0  5
5      0  5
6      0  5
7      0  5
8      0  5
9      0  5

In [12]:
pd.Series([10,20]).repeat([5,2])

0    10
0    10
0    10
0    10
0    10
1    20
1    20
dtype: int64

In [13]:
s1=pd.Series([10,20]).repeat([5,2]).reset_index(drop=True)

In [14]:
s1

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

In [15]:
s1[1]

10

In [16]:
#b) Aggregate function on pandas Series
#Pandas Series.aggregate() function aggregate using one or more operations over the specified axis in the given series object.
sr=pd.Series([1,2,3,4,5])
sr.agg([max,min,sum])

max     5
min     1
sum    15
dtype: int64

c) Series absolute function
Pandas Series.abs() method is used to get the absolute numeric value of each element in Series/DataFrame.

In [17]:
sr=pd.Series([1,-2,3,-4,5,-3,1])
sr.abs()

0    1
1    2
2    3
3    4
4    5
5    3
6    1
dtype: int64

d) Appending Series
Pandas Series.append() function is used to concatenate two or more series object.

Syntax: Series.append(to_append, ignore_index=False, verify_integrity=False)

Parameter : to_append : Series or list/tuple of Series ignore_index : If True, do not use the index labels. verify_integrity : If True, raise Exception on creating index with duplicates

In [27]:
b=sr.astype('float')

In [28]:
b

0    1.0
1   -2.0
2    3.0
3   -4.0
4    5.0
5   -3.0
6    1.0
dtype: float64

In [29]:
b[1]

-2.0

In [30]:
type(b[1])

numpy.float64

f) Between Function
Pandas between() method is used on series to check which values lie between first and second argument.

In [33]:
sr1=pd.Series([1,2,3,4,5])
sr1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [34]:
sr1.between(1,10)

0    True
1    True
2    True
3    True
4    True
dtype: bool

g) All strings functions can be used to extract or modify texts in a series
 
 Upper and Lower Function
 
 Len function
 
 Strip Function
 
 Split Function
 
 Contains Function
 
 Replace Function
 
 Count Function
 
 Startswith and Endswith Function
 
 Find Finction

In [35]:
ser=pd.Series(["Naresh","Charvik","Surya","Yogiii","Venky"])

In [36]:
print(ser.str.upper())

0     NARESH
1    CHARVIK
2      SURYA
3     YOGIII
4      VENKY
dtype: object

In [38]:
print(ser.str.lower())

0     naresh
1    charvik
2      surya
3     yogiii
4      venky
dtype: object

In [39]:
for i in ser:
    print(len(i))

6
7
5
6
5

In [46]:
ser=pd.Series(["  Naresh","Charvik","Surya","  Yogiii","Venky  "])
for i in ser:
    print(i,len(i))

  Naresh 8
Charvik 7
Surya 5
  Yogiii 8
Venky   7

In [47]:
ser=ser.str.strip()
for i in ser:
    print(i,len(i))

Naresh 6
Charvik 7
Surya 5
Yogiii 6
Venky 5

Split Function

In [49]:
ser.str.split()

0     [Naresh]
1    [Charvik]
2      [Surya]
3     [Yogiii]
4      [Venky]
dtype: object

In [50]:
ser.str.split()[0]

['Naresh']

In [57]:
ser=pd.Series(["Venkata@Naresh","Charvik@chat","Surya@Narayana","Yogiii@thaaa","Venky"])
ser.str.contains('@')

0     True
1     True
2     True
3     True
4    False
dtype: bool

In [58]:
b=ser.str.replace('@',' ')
for i in b:
    print(i, len(i))

Venkata Naresh 14
Charvik chat 12
Surya Narayana 14
Yogiii thaaa 12
Venky 5

In [59]:
ser.str.count('a')

0    3
1    2
2    5
3    3
4    0
dtype: int64

In [60]:
ser.str.startswith('N')

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [61]:
ser.str.endswith('h')

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [62]:
ser.str.find('a')

0    4
1    2
2    4
3    9
4   -1
dtype: int64

In [65]:
s1=ser.to_list()

In [66]:
type(s1)

list

A)Creating a Data Frames

In [3]:
lst=["Naresh","Surya","Charik","Surinarayana","Yogii"]
pd.DataFrame(lst)

              0
0        Naresh
1         Surya
2        Charik
3  Surinarayana
4         Yogii

In [4]:
lst1=[["Naresh",10],["Surya",20],["Yogii",30],["Charik",40]]
pd.DataFrame(lst1)

        0   1
0  Naresh  10
1   Surya  20
2   Yogii  30
3  Charik  40

Creating DataFrame from dict of ndarray/lists:
To create DataFrame from dict of narray/list, all the narray must be of same length. If index is passed then the length index should be equal to the length of arrays. If no index is passed, then by default, index will be range(n) where n is the array length.

In [5]:
data={"Name":["Naresh","Charvik","Yeswanth","Praneeth","Akshith"],"Age":[19,20,30,40,50]}
pd.DataFrame(data)

       Name  Age
0    Naresh   19
1   Charvik   20
2  Yeswanth   30
3  Praneeth   40
4   Akshith   50

In [9]:
data2={
    "Name":["Naresh","Yeswanth","Praneeth","Akshith","Madhava Rao"],
    "Age" :[19,20,21,22,23],
    "Qualification":["Btech","MSC","Interpass","MBA","Mtech"],
    "Job":["Driver","Software","Engineer","Youtuber","Actor"]
}
df=pd.DataFrame(data2)
df

          Name  Age Qualification       Job
0       Naresh   19         Btech    Driver
1     Yeswanth   20           MSC  Software
2     Praneeth   21     Interpass  Engineer
3      Akshith   22           MBA  Youtuber
4  Madhava Rao   23         Mtech     Actor

In [10]:
df["Name"]

0         Naresh
1       Yeswanth
2       Praneeth
3        Akshith
4    Madhava Rao
Name: Name, dtype: object

In [12]:
df[["Name","Age"]]

          Name  Age
0       Naresh   19
1     Yeswanth   20
2     Praneeth   21
3      Akshith   22
4  Madhava Rao   23

b) Slicing in DataFrames Using iloc and loc
Pandas comprises many methods for its proper functioning. loc() and iloc() are one of those methods. These are used in slicing data from the Pandas DataFrame. They help in the convenient selection of data from the DataFrame in Python. They are used in filtering the data according to some conditions.

In [20]:
data1={'one':pd.Series([1,2,3,4,5]),
      'two':pd.Series([10,20,30,40,50]),
      'three':pd.Series([100,200,300,400,500]),
      'four':pd.Series([1000,2000,3000,4000,5000])}
df=pd.DataFrame(data1)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000

In [21]:
df.loc[1:2, 'two' : 'three']

   two  three
1   20    200
2   30    300

In [23]:
df.iloc[1:-1, 1:-1]

   two  three
1   20    200
2   30    300
3   40    400

In [24]:
df.iloc[:,2:3]

   three
0    100
1    200
2    300
3    400
4    500

c) Slicing Using Conditions
Using Conditions works with loc basically

In [25]:
df.loc[df['two'] > 20, ['three','four']]

   three  four
2    300  3000
3    400  4000
4    500  5000

In [26]:
df.loc[df['three'] < 300, ['one','four']]

   one  four
0    1  1000
1    2  2000

In [30]:
l=[12,13,14,15,16]
df['Five']=l
df

   one  two  three  four   5    6  Five
0    1   10    100  1000  12  101    12
1    2   20    200  2000  13  202    13
2    3   30    300  3000  14  303    14
3    4   40    400  4000  15  404    15
4    5   50    500  5000  16  505    16

In [32]:
sr=pd.Series([101,202,303,404,505])
df['Six']=sr
df

   one  two  three  four   5    6  Five  Six
0    1   10    100  1000  12  101    12  101
1    2   20    200  2000  13  202    13  202
2    3   30    300  3000  14  303    14  303
3    4   40    400  4000  15  404    15  404
4    5   50    500  5000  16  505    16  505

In [36]:
df['Seven']=df['one']+10
df

   one  two  three  four   5    6  Five  Six  Seven
0    1   10    100  1000  12  101    12  101     11
1    2   20    200  2000  13  202    13  202     12
2    3   30    300  3000  14  303    14  303     13
3    4   40    400  4000  15  404    15  404     14
4    5   50    500  5000  16  505    16  505     15

d) Column Deletion in Dataframes

In [37]:
df

   one  two  three  four   5    6  Five  Six  Seven
0    1   10    100  1000  12  101    12  101     11
1    2   20    200  2000  13  202    13  202     12
2    3   30    300  3000  14  303    14  303     13
3    4   40    400  4000  15  404    15  404     14
4    5   50    500  5000  16  505    16  505     15

In [39]:
del df[5]

In [40]:
df

   one  two  three  four    6  Five  Six  Seven
0    1   10    100  1000  101    12  101     11
1    2   20    200  2000  202    13  202     12
2    3   30    300  3000  303    14  303     13
3    4   40    400  4000  404    15  404     14
4    5   50    500  5000  505    16  505     15

In [41]:
del df[6]

In [42]:
df

   one  two  three  four  Five  Six  Seven
0    1   10    100  1000    12  101     11
1    2   20    200  2000    13  202     12
2    3   30    300  3000    14  303     13
3    4   40    400  4000    15  404     14
4    5   50    500  5000    16  505     15

In [43]:
df.pop('Five')

0    12
1    13
2    14
3    15
4    16
Name: Five, dtype: int64

In [ ]:
#e) Addition of rows

df1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])


df3 = df1.append(df2).reset_index(drop = True)

df3

f) Pandas drop function
Python is a great language for doing data analysis, primarily because of the fantastic ecosystem of data-centric Python packages. Pandas is one of those packages and makes importing and analyzing data much easier.

Pandas provide data analysts a way to delete and filter data frame using .drop() method. Rows or columns can be removed using index label or column name using this method.

Syntax: DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors=raise)

Parameters:

labels: String or list of strings referring row or column name. axis: int or string value, 0 index for Rows and 1 columns for Columns. index or columns: Single label or list. index or columns are an alternative to axis and cannot be used together. level: Used to specify level in case data frame is having multiple level index. inplace: Makes changes in original Data Frame if True. errors: Ignores error if any value from the list doesnt exists and drops rest of the values when errors = ignore

Return type: Dataframe with dropped values

In [26]:
data={ 
    'one':pd.Series([1,2,3,4,5,6,7,8]),
    'two':pd.Series([10,20,30,40,50,60,70,80]),
    'three':pd.Series([100,200,300,400,500,600,700,800]),
    'four':pd.Series([1000,2000,3000,4000,5000,6000,7000,8000])
}
df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000
5    6   60    600  6000
6    7   70    700  7000
7    8   80    800  8000

In [27]:
df.drop([0,1], axis = 0, inplace = True)
df

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000
5    6   60    600  6000
6    7   70    700  7000
7    8   80    800  8000

In [28]:
df.drop(['one','two'],axis=1,inplace=True)
df

   three  four
2    300  3000
3    400  4000
4    500  5000
5    600  6000
6    700  7000
7    800  8000

g) Transposing a DataFrame
The .T attribute in a Pandas DataFrame is used to transpose the dataframe, i.e., to flip the rows and columns. The result of transposing a dataframe is a new dataframe with the original rows as columns and the original columns as rows.

Here's an example to illustrate the use of the .T attribute:

In [33]:
data={
    'one':pd.Series([1,2,3,4,5,6]),
    'two':pd.Series([10,20,30,40,50,60]),
    'three':pd.Series([100,200,300,400,500,600]),
    'five':pd.Series([1000,2000,3000,4000,5000,6000])  
}
df=pd.DataFrame(data)
df

   one  two  three  five
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000
5    6   60    600  6000

In [34]:
df.T

          0     1     2     3     4     5
one       1     2     3     4     5     6
two      10    20    30    40    50    60
three   100   200   300   400   500   600
five   1000  2000  3000  4000  5000  6000

h) A set of more DataFrame Functionalities

In [35]:
df

   one  two  three  five
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000
5    6   60    600  6000

axes function
The .axes attribute in a Pandas DataFrame returns a list with the row and column labels of the DataFrame. The first element of the list is the row labels (index), and the second element is the column labels.

In [36]:
df.axes

[RangeIndex(start=0, stop=6, step=1),
 Index(['one', 'two', 'three', 'five'], dtype='object')]

ndim function
The .ndim attribute in a Pandas DataFrame returns the number of dimensions of the dataframe, which is always 2 for a DataFrame (row-and-column format).

In [37]:
df.ndim

2

3.dtypes
The .dtypes attribute in a Pandas DataFrame returns the data types of the columns in the DataFrame. The result is a Series with the column names as index and the data types of the columns as values.

In [38]:
df.dtypes

one      int64
two      int64
three    int64
five     int64
dtype: object

shape function
The .shape attribute in a Pandas DataFrame returns the dimensions (number of rows, number of columns) of the DataFrame as a tuple.

In [39]:
df.shape

(6, 4)

head() function

In [41]:
data1={
    'one':pd.Series(['Naresh','Praneeth','Suryaa','Pavan','tATA']),
    'two':pd.Series([1,2,3,4,5]),
    'three':pd.Series([10,20,30,40,50]),
    'four':pd.Series([100,200,300,400,500])
}
df=pd.DataFrame(data1)
df

        one  two  three  four
0    Naresh    1     10   100
1  Praneeth    2     20   200
2    Suryaa    3     30   300
3     Pavan    4     40   400
4      tATA    5     50   500

In [43]:
#returns the fist 3rows of the matrix 
df.head(3)

        one  two  three  four
0    Naresh    1     10   100
1  Praneeth    2     20   200
2    Suryaa    3     30   300

In [44]:
#returns the  last three rows of the matrix
df.tail(3)

      one  two  three  four
2  Suryaa    3     30   300
3   Pavan    4     40   400
4    tATA    5     50   500

In [47]:
df=pd.DataFrame(data)
df.empty

False

i) Statistical or Mathematical Functions
Sum 
 
 Mean 
 
 Median 
 
 Mode 
 
 Variance 
 
 Min 
 
 Max 
 
 Standard Deviation

In [52]:
data1={
    'one':pd.Series([1,2,3,4,5,6]),
    'two':pd.Series([10,20,30,40,50,60]),
    'three':pd.Series([100,200,300,400,500,600]),
    'four':pd.Series([1000,2000,3000,4000,5000,6000])
}
df=pd.DataFrame(data1)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000
5    6   60    600  6000

In [54]:
df.sum()

one         21
two        210
three     2100
four     21000
dtype: int64

In [56]:
df.mean()

one         3.5
two        35.0
three     350.0
four     3500.0
dtype: float64

In [57]:
df.median()

one         3.5
two        35.0
three     350.0
four     3500.0
dtype: float64

In [60]:
datam=pd.DataFrame({'A':[1,2,3,4,5,6],'B':[2,3,4,5,6,7]})
print('A',datam['A'].mode())
print('B',datam['B'].mode())

A 0    1
1    2
2    3
3    4
4    5
5    6
Name: A, dtype: int64
B 0    2
1    3
2    4
3    5
4    6
5    7
Name: B, dtype: int64

Variance

In [61]:
df.var()

one            3.5
two          350.0
three      35000.0
four     3500000.0
dtype: float64

In [62]:
df.min()

one         1
two        10
three     100
four     1000
dtype: int64

In [63]:
df.max()

one         6
two        60
three     600
four     6000
dtype: int64

In [64]:
df.std()

one         1.870829
two        18.708287
three     187.082869
four     1870.828693
dtype: float64

j) Describe Function
The describe() method in a Pandas DataFrame returns descriptive statistics of the data in the DataFrame. It provides a quick summary of the central tendency, dispersion, and shape of the distribution of a set of numerical data.

The default behavior of describe() is to compute descriptive statistics for all numerical columns in the DataFrame. If you want to compute descriptive statistics for a specific column, you can pass the name of the column as an argument.

In [68]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000]),
        'five' : pd.Series(['A','B','C','D'])
       }
df=pd.DataFrame(data)
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

k) Pipe Functions
1. Pipe Function

The pipe() method in a Pandas DataFrame allows you to apply a function to the DataFrame, similar to the way the apply() method works. The difference is that pipe() allows you to chain multiple operations together by passing the output of one function to the input of the next function.

In [69]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [75]:
def add1(i,j):
    return i+j
df.pipe(add1,10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [76]:
def sub1(i,j):
    return i-j
df.pipe(sub1,10)

   one  two  three  four
0   -9    0     90   990
1   -8   10    190  1990
2   -7   20    290  2990
3   -6   30    390  3990

In [78]:
def mean1(col):
    return col.mean()
def sqr(col):
    return col**2
df.pipe(mean1).pipe(sqr)

one            6.25
two          625.00
three      62500.00
four     6250000.00
dtype: float64

2. Apply Function
The apply() method in a Pandas DataFrame allows you to apply a function to the DataFrame, either to individual elements or to the entire DataFrame. The function can be either a built-in Python function or a user-defined function.

In [79]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

print(df.apply(np.mean))

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [80]:
df.apply(lambda x: x.max()-x.min())

one         3
two        30
three     300
four     3000
dtype: int64

3. Apply map function
The map() method in a Pandas DataFrame allows you to apply a function to each element of a specific column of the DataFrame. The function can be either a built-in Python function or a user-defined function.

In [81]:
df.applymap(lambda x:x*100)

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

applymap and apply are both functions in the pandas library used for applying a function to elements of a pandas DataFrame or Series.

applymap is used to apply a function to every element of a DataFrame. It returns a new DataFrame where each element has been modified by the input function.

apply is used to apply a function along any axis of a DataFrame or Series. It returns either a Series or a DataFrame, depending on the axis along which the function is applied and the return value of the function. Unlike applymap, apply can take into account the context of the data, such as the row or column label.

So, applymap is meant for element-wise operations while apply can be used for both element-wise and row/column-wise operations.

In [82]:
df = pd.DataFrame({ 'A': [1.2, 3.4, 5.6], 
                    'B': [7.8, 9.1, 2.3]})

df_1 = df.applymap(np.int64)
print(df_1)

df_2 = df.apply(lambda row : row.mean(), axis = 0)
print(df_2)

   A  B
0  1  7
1  3  9
2  5  2
A    3.4
B    6.4
dtype: float64

l) Reindex Function
The reindex function in Pandas is used to change the row labels and/or column labels of a DataFrame. This function can be used to align data from multiple DataFrames or to update the labels based on new data. The function takes in a list or an array of new labels as its first argument and, optionally, a fill value to replace any missing values. The reindexing can be done along either the row axis (0) or the column axis (1). The reindexed DataFrame is returned.

In [84]:
data = { 'one'   : pd.Series([1, 2, 3, 4,5,6]),
         'two'   : pd.Series([10, 20, 30, 40,50,60]),
         'three' : pd.Series([100, 200, 300, 400,500,600]),
         'four'  : pd.Series([1000, 2000, 3000, 4000,5000,6000])}

df = pd.DataFrame(data)
print("-"*20)
df.reindex([1,2,3,4,5])

--------------------

   one  two  three  four
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000
5    6   60    600  6000

In [85]:
data = {'Name' : ['John', 'Jane', 'Jim', 'Joan'],
        'Age'  : [25, 30, 35, 40],
        'City' : ['New York', 'Los Angeles', 'Chicago', 'Houston']}

df = pd.DataFrame(data)

df.reindex(columns = ['Name','City','Age'])

   Name         City  Age
0  John     New York   25
1  Jane  Los Angeles   30
2   Jim      Chicago   35
3  Joan      Houston   40

m) Renaming Columns in Pandas DataFrame
The rename function in Pandas is used to change the row labels and/or column labels of a DataFrame. It can be used to update the names of one or multiple rows or columns by passing a dictionary of new names as its argument. The dictionary should have the old names as keys and the new names as values

In [94]:
data={
    'one':pd.Series([1,2,3,4,5]),
    'two':pd.Series([10,20,30,40,50]),
    'three':pd.Series([100,200,300,400,500]),
    'four':pd.Series([1000,2000,3000,4000,5000])
}
df=pd.DataFrame(data)
df.rename(columns={'one':'One','two':'Two','three':'Three','four':'Four','five':'Five'},inplace=True,index={0:'a',1:'b',2:'c',3:'c',4:'d'})
df

   One  Two  Three  Four
a    1   10    100  1000
b    2   20    200  2000
c    3   30    300  3000
c    4   40    400  4000
d    5   50    500  5000

In [97]:
data = { 'one'   : pd.Series([20,10,8,230]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 500, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0   20   10    100  1000
1   10   20    200  2000
2    8   30    500  3000
3  230   40    400  4000

Sort with respect to Scecific Column

In [98]:
df.sort_values(by='one')

   one  two  three  four
2    8   30    500  3000
1   10   20    200  2000
0   20   10    100  1000
3  230   40    400  4000

Sort in Scecific Order

In [99]:
df.sort_values(by='one' ,ascending=False)

   one  two  three  four
3  230   40    400  4000
0   20   10    100  1000
1   10   20    200  2000
2    8   30    500  3000

Sort in Scecific Order based on multiple Columns

In [101]:
df.sort_values(by=['one','two'])

   one  two  three  four
2    8   30    500  3000
1   10   20    200  2000
0   20   10    100  1000
3  230   40    400  4000

Sort with Specific Sorting Algorithm:<br>

quicksort
mergesort
heapsort

In [102]:
df.sort_values(by=['one','two'],kind='mergesort')

   one  two  three  four
2    8   30    500  3000
1   10   20    200  2000
0   20   10    100  1000
3  230   40    400  4000

In [111]:
cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]
          }
pf=pd.DataFrame(cricket)
pf

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [116]:
pf.groupby('Team').groups

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [119]:
pf.groupby(['Team','Year']).get_group(('Australia',2014))

        Team  Rank  Year  Points
2  Australia     1  2014     891

If the data is not present then we will be getting an error

Adding some statistical computation on top of groupby

In [120]:
pf.groupby(['Team','Points']).sum()

                  Rank  Year
Team      Points
Australia 815        2  2015
          891        1  2014
India     782        2  2017
          801        3  2015
          876        2  2014
NZ        691        4  2014
          758        2  2016
          883        1  2015
SA        776        3  2014
          784        4  2015
          824        1  2017
          834        1  2016

In [122]:
pf.groupby(['Team']).sum()['Points']

Team
Australia    1706
India        2459
NZ           2332
SA           3218
Name: Points, dtype: int64

In [124]:
groups = pf.groupby('Team')

groups['Points'].agg([np.sum, np.mean, np.std,np.max,np.min])

            sum        mean        std  amax  amin
Team
Australia  1706  853.000000  53.740115   891   815
India      2459  819.666667  49.702448   876   782
NZ         2332  777.333333  97.449132   883   691
SA         3218  804.500000  28.769196   834   776

In [125]:
pf.groupby('Team').filter(lambda x : len(x) == 4)

  Team  Rank  Year  Points
4   SA     3  2014     776
5   SA     4  2015     784
6   SA     1  2016     834
7   SA     1  2017     824

In [126]:
pf.groupby('Team').filter(lambda x : len(x) == 3)

     Team  Rank  Year  Points
0   India     2  2014     876
1   India     3  2015     801
8      NZ     2  2016     758
9      NZ     4  2014     691
10     NZ     1  2015     883
11  India     2  2017     782

In [132]:
pf=pd.read_csv("C:\\Users\\DELL\\Desktop\\Data Science notes\\Libraries\\Football.csv")
pf

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
655,Netherlands,Eredivisie,(UTR),Gyrano Kerk,24,0,2155,10,7.49,0.33,50,18,2.20,0.79,2020
656,Netherlands,Eredivisie,(AJA),Quincy Promes,18,2,1573,12,9.77,0.59,56,30,3.38,1.81,2020
657,Netherlands,Eredivisie,(PSV),Denzel Dumfries,25,0,2363,7,5.72,0.23,45,14,1.81,0.56,2020
658,Netherlands,Eredivisie,NaN,Cyriel Dessers,26,0,2461,15,14.51,0.56,84,43,3.24,1.66,2020
659,Netherlands,Eredivisie,(PSV),Cody Gakpo,14,11,1557,7,4.43,0.27,38,15,2.32,0.92,2020

In [133]:
pf.head(6)

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016
5,Spain,La Liga,(JUV),Cristiano Ronaldo,29,0,2634,42,24.68,0.89,162,60,5.84,2.16,2016

In [136]:
link = 'https://raw.githubusercontent.com/AshishJangra27/Data-Analysis-with-Python-GFG/main/3.%20Data%20Preprocessing%20-%20Removing%20Null%20Value%20Rows/googleplaystore.csv'
pf=pd.read_csv(link)
pf.head(20)

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up
5,Paper flowers instructions,ART_AND_DESIGN,4.4,167,5.6M,"50,000+",Free,0,Everyone,Art & Design,"March 26, 2017",1.0,2.3 and up
6,Smoke Effect Photo Maker - Smoke Editor,ART_AND_DESIGN,3.8,178,19M,"50,000+",Free,0,Everyone,Art & Design,"April 26, 2018",1.1,4.0.3 and up
7,Infinite Painter,ART_AND_DESIGN,4.1,36815,29M,"1,000,000+",Free,0,Everyone,Art & Design,"June 14, 2018",6.1.61.1,4.2 and up
8,Garden Coloring Book,ART_AND_DESIGN,4.4,13791,33M,"1,000,000+",Free,0,Everyone,Art & Design,"September 20, 2017",2.9.2,3.0 and up
9,Kids Paint Free - Drawing Fun,ART_AND_DESIGN,4.7,121,3.1M,"10,000+",Free,0,Everyone,Art & Design;Creativity,"July 3, 2018",2.8,4.0.3 and up
10,Text on Photo - Fonteee,ART_AND_DESIGN,4.4,13880,28M,"1,000,000+",Free,0,Everyone,Art & Design,"October 27, 2017",1.0.4,4.1 and up
11,Name Art Photo Editor - Focus n Filters,ART_AND_DESIGN,4.4,8788,12M,"1,000,000+",Free,0,Everyone,Art & Design,"July 31, 2018",1.0.15,4.0 and up
12,Tattoo Name On My Photo Editor,ART_AND_DESIGN,4.2,44829,20M,"10,000,000+",Free,0,Teen,Art & Design,"April 2, 2018",3.8,4.1 and up
13,Mandala Coloring Book,ART_AND_DESIGN,4.6,4326,21M,"100,000+",Free,0,Everyone,Art & Design,"June 26, 2018",1.0.4,4.4 and up
14,3D Color Pixel by Number - Sandbox Art Coloring,ART_AND_DESIGN,4.4,1518,37M,"100,000+",Free,0,Everyone,Art & Design,"August 3, 2018",1.2.3,2.3 and up
15,Learn To Draw Kawaii Characters,ART_AND_DESIGN,3.2,55,2.7M,"5,000+",Free,0,Everyone,Art & Design,"June 6, 2018",NaN,4.2 and up
16,Photo Designer - Write your name with shapes,ART_AND_DESIGN,4.7,3632,5.5M,"500,000+",Free,0,Everyone,Art & Design,"July 31, 2018",3.1,4.1 and up
17,350 Diy Room Decor Ideas,ART_AND_DESIGN,4.5,27,17M,"10,000+",Free,0,Everyone,Art & Design,"November 7, 2017",1.0,2.3 and up
18,FlipaClip - Cartoon animation,ART_AND_DESIGN,4.3,194216,39M,"5,000,000+",Free,0,Everyone,Art & Design,"August 3, 2018",2.2.5,4.0.3 and up
19,ibis Paint X,ART_AND_DESIGN,4.6,224399,31M,"10,000,000+",Free,0,Everyone,Art & Design,"July 30, 2018",5.5.4,4.1 and up

b) Pandas Info Function
Pandas dataframe.info() function is used to get a concise summary of the dataframe. It comes really handy when doing exploratory analysis of the data. To get a quick overview of the dataset we use the dataframe.info() function.

Syntax: DataFrame.info(verbose=None, buf=None, max_cols=None, memory_usage=None, null_counts=None)

In [137]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     4 non-null      int64
 1   two     4 non-null      int64
 2   three   4 non-null      int64
 3   four    4 non-null      int64
dtypes: int64(4)
memory usage: 260.0 bytes

In [140]:
pf.isnull()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10836,False,False,False,False,False,False,False,False,False,False,False,False,False
10837,False,False,False,False,False,False,False,False,False,False,False,False,False
10838,False,False,True,False,False,False,False,False,False,False,False,False,False
10839,False,False,False,False,False,False,False,False,False,False,False,False,False
10840,False,False,False,False,False,False,False,False,False,False,False,False,False

f we use the sum function along with it then we can get how many null values are present in each columns

In [141]:
pf.isnull().sum()

App                  0
Category             0
Rating            1474
Reviews              0
Size                 0
Installs             0
Type                 1
Price                0
Content Rating       1
Genres               0
Last Updated         0
Current Ver          8
Android Ver          3
dtype: int64

d) Quantile function to get the specific percentile value
Let us check the 80 percentile value of each columns using describe function first

In [147]:
pf.describe(percentiles=[.80])

            Rating
count  9367.000000
mean      4.193338
std       0.537431
min       1.000000
50%       4.300000
80%       4.600000
max      19.000000

e) Copy function
If we normal do:
de=df
Then a change in de will affect the data of df as well so we need to copy in such a way that it creates a totally new object and does not affect the old dataframe

In [153]:
de = pf.copy()
de.head(3)

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up

f) Value Counts function

KeyError: 'Player Names'